yi-pian/TI_InvitationTournament/MSPM0_Signal_Contest/08_applications/signal_contest_template/signal_contest_template.syscfg
/** Empty contest template: add only the peripherals required by module README files. */
//@cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default"
//@v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)"
// @cliArgs --board /ti/boards/LP_MSPM0G3507 --rtos nortos

const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");
const Board = scripting.addModule("/ti/driverlib/Board");
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");

ProjectConfig.genLibCMSIS = true;
SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn = true;
